# ── Core CLI Tools ───────────────────────────────────
brew "stow"
brew "git"
brew "jq"
brew "yq"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zoxide"
brew "fzf"
brew "atuin"
brew "starship"
brew "direnv"
brew "tmux"
brew "neovim"
brew "ranger"
brew "xh"
brew "glow"
brew "television"
brew "git-filter-repo"

# ── Shell ────────────────────────────────────────────
brew "zsh-autosuggestions"
brew "nushell"
brew "sesh"

# ── Terraform / IaC ─────────────────────────────────
brew "tfenv"
brew "tflint"
brew "terraform-docs"
brew "infracost"
brew "trivy"

# ── AWS ──────────────────────────────────────────────
brew "awscli"
brew "aws-vault"

# ── Kubernetes ───────────────────────────────────────
brew "kubectl"
brew "kubectx"
brew "helm"
brew "k9s"
brew "kustomize"
brew "argocd"
brew "stern"

# ── Docker ───────────────────────────────────────────
brew "docker"
brew "docker-compose"
brew "lazydocker"

# ── Git / GitHub ─────────────────────────────────────
brew "gh"
brew "lazygit"

# ── Languages / Runtimes ────────────────────────────
brew "go"

# ── Casks ────────────────────────────────────────────
cask "ghostty"
cask "wireshark"
